{
  "places": [
    {
      "id": 1,
      "name": "Horsley Hills",
      "description": "Horsley Hills, also known as Yenugulla Mallamma Konda, is a beautiful hill station located in Andhra Pradesh, India. Situated at an elevation of 1,265 meters above sea level, it offers breathtaking views of the surrounding landscape. The hills are named after W.D. Horsley, a British collector who built his residence here in the 19th century. The area is known for its dense forests, rich biodiversity, and pleasant climate throughout the year. Visitors can enjoy various activities like trekking, bird watching, and nature walks. The sunset point offers spectacular views of the Western Ghats, making it a perfect spot for photography enthusiasts.",
      "city": "Madanapalle",
      "image_url": "/Images/Horsley_Hills.jpg",
      "rating": 4.5,
      "category": "Hills",
      "location": "Horsley Hills, Madanapalle, Andhra Pradesh",
      "images": [
        "/Images/Horsley_Hills.jpg",
        "/Images/Horsley_Hills_2.jpg",
        "/Images/Horsley_Hills_3.jpg"
      ],
      "features": [
        "Scenic viewpoints",
        "Trekking trails",
        "Nature walks",
        "Bird watching",
        "Photography spots"
      ],
      "visiting_hours": "6:00 AM - 6:00 PM",
      "best_time_to_visit": "October to February",
      "entry_fee": "₹50 per person",
      "how_to_reach": "Nearest airport: Tirupati (100 km), Nearest railway station: Madanapalle (27 km)",
      "nearby_attractions": [
        "Gali Bandalu Viewpoint",
        "Kalyani Viewpoint",
        "Gangotri Lake",
        "Environmental Park"
      ],
      "facilities": [
        "Parking",
        "Restrooms",
        "Restaurants",
        "Accommodation",
        "Guided tours"
      ],
      "history": "Horsley Hills was discovered in the 19th century by W.D. Horsley, a British collector who built his residence here. The area was developed as a hill station during the British Raj and has since become a popular tourist destination in Andhra Pradesh.",
      "weather": {
        "summer": "20°C - 35°C",
        "winter": "10°C - 25°C",
        "monsoon": "Moderate rainfall"
      },
      "tips": [
        "Carry warm clothes as temperatures can drop in the evening",
        "Best time to visit is early morning for sunrise views",
        "Book accommodation in advance during peak season",
        "Carry water and snacks for trekking",
        "Respect local wildlife and maintain cleanliness"
      ]
    }
  ]
} 